{
    "id": "928ce3b7-a190-4bf4-bb58-38f631069449",
    "title": "Twins of Destiny",
    "slug": "twins-of-destiny-plot",
    "state": "public",
    "isWip": false,
    "isDraft": false,
    "entityClass": "Plot",
    "icon": "fa-solid fa-file",
    "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/twins-of-destiny-plot",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": null,
    "updateDate": {
        "date": "2024-10-09 12:46:22.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "position": null,
    "excerpt": null,
    "wordcount": 2792,
    "creationDate": {
        "date": "2024-10-09 12:41:43.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "publicationDate": {
        "date": "2024-10-09 12:43:17.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "notificationDate": null,
    "likes": null,
    "views": 14,
    "userMetadata": null,
    "articleMetadata": null,
    "cssClasses": null,
    "displayCss": null,
    "templateType": "plot",
    "customArticleTemplate": null,
    "editor": "wysiwyg",
    "content": "Two twins born in the world of Theroes are drawn into a series of events that may be.\r\n\r\n[h2]Session 1: Return to Setessa[/h2]\r\n\r\n\r\nAs Calix slept, he felt himself being violently pulled into the Nyx. He had felt this before, and his heart sank at the meaning of it. It seemed like an age as he travelled through it, but it was merely seconds. After his eyes had adjusted, he saw before him a large marble table with two gods sitting. Heliod, God of the Sun and Phenax, God of Deception were placing a bet over a soul of a poor mortal. Focusing on this human figure, Calix realized with shock, that it was his brother, the dark curls and bright blue eyes were unmistakable. Before Calix could ponder this series of events, Thassa, God of the Sea, appeared before him. Disappointment was clear, as she scolded him for attempting to hide from her these last many years. Gesturing towards his brother, Thassa directed Calix to journey to Setessa and guide Nyklos to become Heliod's Champion.\r\n\r\nWhen Calix rose out of sleep, it was dawn. He quickly picked up his supplies, travelling clothes, weapons, and armor - leaving a note for Darius before leaving the small house that was their home. With trepidation Calix realized that it was raining, so he attempted to ensure that no part of his body came into contact with the rain, protecting his face with a hood. Travelling for about half a day (much shorter then the normal two days), Calix did not run into any passing merchants, and due to the rain never saw anything more then 20 feet in front of him. Eventually the rain eased, and sunlight broke through the clouds to unveil the city of Setessa.\r\n\r\nAs Calix moved through the familiar sights and smells that was the Abora Market, he noticed that one particular merchant was watching him, and appeared to be wary of his presence. Intrigued Calix introduced himself and identified that the merchant believed he was his twin brother Nyklos. After clearing up the misunderstanding Calix was directed to go to The Ambrosia Inn where his brother was a regular.\r\n\r\nEntering the inn, Calix immediately identified his brother, and noticed that he appeared to be somewhat intoxicated and flirting outrageously with the big breasted bargirl. He decided to make his way to the bar, and ordered a wine while sitting down. Oblivious to his surroundings, Nyklos didn't notice Calix until he followed the eyesight of the visibly shocked Lyla. Upon seeing his brother Nyklos face scrunched in anger and hurt, swinging his closed fist towards Calix, who didn't move an inch. As Nyklos fell from his stool, he looked up to the smirking face of his brother, and immediately got up to swing his fist again, which failed. On the third attempt, Calix visibly annoyed at this point, raised his finger and cast a spell to command his brother to stop. With the brief break from his brothers aggression, Calix explained that he was here in relation to Nyklos recent dream.\r\n\r\nNyklos clearly not in the mood to deal with his brother and no longer under the control of Calix magic, stormed out of the inn. Sighing and still annoyed, Calix followed him out and called out to Nyklos to slow down and to talk. As they walked through the city, one calling out and the other cursing, the citizens of Setessa looked on in horror at the visual of two Nyklos. As their anger increased, a group of guards intervened informing Calix that the Champion of Thassa was required to attend to the palace. Cursing to the sky, Calix agreed to accompany the guards throwing annoyed looks at his brother.\r\n\r\nAs the entered the room, Calix anger increased seeing the Karametra, God of Harvests sitting on her throne. An intense conversation followed, with Karametra attempting to identify Calix reasoning of entering the city, and Calix refusing to divulge the reason beyond stating that he was there is retrieve his brother and leave the city. A compromise was made, and Calix provided the God a vision of the future, which involved a God dying, the Horned God rising, and the third God killing the usurper. Karametra ponded the vision for a few seconds, before leaving the twins to their own devices.\r\n\r\nFurious at the God's meddling and his brothers stubbornness, Calix demanded to have a fight, without the use of magic, weapons or armor. The guards gleefully lead the twins to a close by arena, and placed bets on who they thought would win. The fight wasn't a complex one, punch after punch Nyklos pummeled his brother, demanding to know the reasons why he left all those years ago, and became frustrated with Calix vague responses. It lead to Calix becoming unconscious and requiring help from the local healer. Feeling guilty, Nyklos ensured that Calix was returned to relatively good health before they decided to have a truce, and make their way to Akros. By this point, it has become dusk, and they both agreed that a night in the The Ambrosia Inn, with an early start would be the best next step. That's what Calix did, Nyklos thought it was more appropriate to have his way with Lyla as a going away gift.\r\n\r\n[h2]Session 2: Journey to Akros[/h2]\r\n\r\nDawn breaks and the twins awake in their separate rooms at the Ambrosia Inn. They group up in the inn's common room, where Nyklos says goodbye to his friend Demnos and notices that Lyla was not present. Calix encourages his brother to join him at the Abora Market in order to obtain supplies before their long journey. As they weaved amongst the morning hustle of the market, they speak in short bursts to one another, neither willing to go any further then a simple nod, or shake. They buy a few days rations, a two-person tent, a map of Theros and Nyklos purchases a lyre for himself, arguing that he could make them money on their travels.\r\n\r\nBy mid morning they had agreed, at least on one thing, they would travel from Setessa to Listes - Calix explaining that the Lagonna Band Centaurs lived around the area, and being a merchant band that travels between Akros, Meletis, and Setessa they may be able to obtain assistance in making the travel safer for them. After their supplies had been packed away, the twins leave Setessa via the pathway that leads them past the infamous famous cave of the Winter Nexus, through the Spring Nexus and its orchards of golden apples, and around the olive groves located in the Summer Nexus to a pathway that branched off to two locations, the signs noting that west would take the brothers to Listes and north would take them to to Amatropho.\r\n\r\nTravelling silently through the lightly forested plains that separate Setessa from Listes, the twins do no encounter any fellow travelers close enough to engage with them, just seeing silhouettes in the horizon. They pushed for seven hours, and as the sun began to fall, they noticed that the lights of the village of Listes was ahead of them. Both wanting to get away from each other, they forged on agreeing that a night in an inn in the village was better then the tent out in nature. As they entered the small faming village adjacent to the fortress of Listes, they saw immediately the small inn in the middle of the village with \"The Satyr's Horn\" emblazoned on a large sign. Entering eagerly, they sit down and order their dinner, Nyklos a seafood stew, and Calix the local fish and steamed vegetables. As Calix enjoyed his dinner with a glass of Setessan wine, Nyklos decided to introduce himself to the middle aged woman who was tending the bar.\r\n\r\nA lively discussion follows with Nyklos attempting to convince her that he was a world renowned Bard, which wasn't successful considering that the particular bard was a woman, despite the wild story of an angry sorcerer and a spell that changed his physical appearance. Jovially, she encouraged Nyklos to speak to the Satyr who was performing for the inns patrons directly if he wanted to make a little coin. Cockily Nyklos made his way to the Satyr, and offered that if the satyr allowed him to play, Nyklos would fund the satyr's drinks for the night. Amused that this travelling minstrel would offer such a bargain, the satyr offered a duet instead. The following scene caused Calix to hang his head in embarrassment, and the patrons to giggle and heckle Nyklos. Three times the bard attempted to join the performing satyr, the first sounding like a cat being murdered, the second breaking strings on his lute, and the third caused many people to block their ears. The satyr laughing encouraged the exhausted Nyklos to get some rest, and suggested that he try another day, and another inn. The twins agree to stay the night, and continue their travels to Akros in the morning.\r\n\r\nLeaving the inn, with the sounds of laughing behind them, Calix notices a travelling caravan of humans and centaurs and decides to approach them, asking if it was possible for the twins to join the them if they were travelling towards Akros. To hire them, the leader of the caravan put each of the twins through a test. Nyklos was tested with strength, and after a few knuckles were smacked, he was hired. Being a mercenary, the leader sized up Calix with distaste and asked him the identify an item far into the sky. Calix looked and immediately knew what it was as he watched the beautiful Anvilwrought Raptor fly off into the distance. Grunting the leader directed Calix to be on look out at the front of the caravan, and Nyklos to guard the back of it.\r\n\r\nThey travel six hours without any incident, and decided to take a break for afternoon tea. Bursting to relieve himself, Calix ran off to the privacy of the bushes, whipped in out, and began to urinate. As he was about to release a sigh of relief, an loud feline-like roar shattered into the quiet air. Startled Calix looked down and noticed a golden maned Leonin who he somehow did not see in his rush. Furious that his rest was broken by the disgusting human standing ahead of him, the leonin grabbed his axe and knocked Calix unconscious in a split second. Even more disgusted in the human, the leonin walked up to the road, informed Nyklos of what had occurred, and headed down the path way back to Listes. Nykos made his way to his brother, laughed at the sight of his unconscious with his pants half way down his legs, and healed him back to consciousness. Mortified Calix quickly walked back to the caravan, positioned himself at the front of the pack, and began to meditate to block out all the smirking faces surrounding him.\r\n\r\nAfter a few more hours of travel, the caravan arrives at Deyda Harbor. The centaurs bid the group fair well as they entered the main town, whilst the twins and their human companions transport their goods from the carts to the caravans boat. Once the boat was ready to go, Calix was given a look out role in the crows nest, whilst Nykos was to guard the hull. Before the journey was to commence, Calix out of fear of the opened body of water, prayed to Thassa, God of the Sea and offered a single silver coin as an offering for a peaceful journey to Akros. As Calix flicked the coin into the water, a large hand made of water raised about the surface and snatched the falling coin, signaling that the God accepted the offering. Watching the hand fall back into the river, Calix couldn't help but notice that the water was calling to him, drawing him closer to the edge of the ship. Without the willpower to fight it, and his natural curiosity overwhelming him, Calix ran his hand along the surface. As his fingers touched the watery realm of Thassa, Calix felt slimy fingers return that touch and everything went dark.\r\n\r\nNonchalant Nyklos was watching his brother and noticed that something seemed off about him, but couldn't be bothered to actually do anything about it. When his sight returned, Calix with dread noticed he was in Thassa's Palace deep below the surface, and she had two formidable looking Naiads flanking her. Thassa smiled at her Oracle, and told Calix that he would receive her protection on the journey of the river, however she expects that on his arrival to Akros, Calix would seek her out for more guidance, and then with a flick of her finger forced him out of her realm into his body.\r\n\r\nShaken, but confident that he had some form of protection by his God, Calix made his way into the crows nest, and the journey started. After an uneventful few hours and as the night fell, the ships crew carried out of the hull stone which was placed at the helm, Calix was amazed that the stone appeared to be inbued with light magic, and could see that it gave the ship enough visibility to not crash into rocks or the shoreline as they sailed through the night. His shift over, Calix made his way to his twin brother. Ignoring his brothers protests, Calix eagerly retold the story of Birth Of Erebos, in hopes that it would inspire Nyklos to make the choice of Heliod. A passing crewmate, who happened to be a follower of Heliod was excited to talk about his God, having dealt with the Thassa fearing sailors for the last few days. He threw himself into a highly energetic performance of the tale Battle With Purphoros much to Nyklos' chagrin.\r\n\r\nFeeling that he had accomplished what he set out to do Calix made his way to his cabin where he was confronted by one of the handsome crewmates Ronas, who propositioned the oracle for a night of passionate lovemaking. Calix refused and apologized Ronas, explaining that he was committed to his husband Darius who was waiting for him at home. Not to be disappointed, Ronas went looking for Nyklos, who was very happy to provide Ronas with the good time he was looking for - much to the excitement and entertainment of the onlooking crew.\r\n\r\nAs the morning sun rose, Calix was standing in the crow's nest thanking Thassa silently for the quiet night, without any dangerous incidents occurring, although he did wish that he was deaf after hearing the grunts, thudding, and cheers that occurred throughout the night, in response to his brother's wild behavior. They had not travelled long when Calix noticed something in the water, and called out to the captain to change the ships course, narrowly avoiding a small family of tritions who were also travelling the river. Two hours after this, Calix notices with horror as the passed through a bed in the river, that a large amount of rocks on the shoreline had started to move. Urgently alerting the ship of the danger, the crew watched as the large being rose up from the ground and exposed its eye - a cyclops was staring at the ship, visibly angrily.\r\n\r\nRoaring something in Giant, the cyclopes raised a large boulder over his head, and threw it in the direction of the ship, narrowly missing. Scrambling for his crossbow, Calix took a shot at the hulking figure, cursing when the bolt flew past it. As Nyklos was getting his shot set up, Calix noticed that two naiads had joined the battle, Thassa's protection in action. The nymphs attacked the creature with blistering psychic attacks, while Nykos began shooting arrows. It felt the battle was going well, until the cyclops dug deep into the water and brought up large volumes of mud, flinging them and seriously hurting Nykos, Calix, and Ronas. Screaming to the naiads for help, one charged forward and cast an illusion of a wall that was so strong, the cyclops couldn't distinguish what was reality and what was magic. Three times the wall was raised, confounding the cyclops, and twice the monstrous creature was able to bring it crushing down. However it was too much, with the twins shooting bolts and arrows into its hide, and the naiads bashing into its mind, the cyclops never stood a chance. Its eye began to bleed, and then eventually exploded, killing it.\r\n\r\nThe twins exhausted from the battle, collapse to the deck, eager for the crew and ship to reach Akros.",
    "author": {
        "id": "25c82226-f40e-4866-b883-0b0f87436174",
        "title": "AloisiHaelgor",
        "slug": null,
        "state": null,
        "isWip": null,
        "isDraft": null,
        "entityClass": "User",
        "icon": "fa-solid fa-user",
        "url": "https://www.worldanvil.com/author/AloisiHaelgor",
        "subscribergroups": [],
        "folderId": null,
        "tags": null,
        "updateDate": null
    },
    "category": {
        "id": "c8ccec11-0f8b-4ea3-985d-6d49c1bf663f",
        "title": "Campaigns",
        "slug": "campaigns-category",
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "Category",
        "icon": "fa-solid fa-folder",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/c/campaigns-category",
        "subscribergroups": [],
        "folderId": null,
        "tags": null,
        "updateDate": null
    },
    "world": {
        "id": "c1ac2421-363b-49d0-b5a1-fd68f279c9cc",
        "title": "The Eternal Wheel",
        "slug": "the-eternal-wheel-aloisihaelgor",
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "World",
        "icon": "fa-solid fa-globe-stand",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor",
        "subscribergroups": [
            {
                "id": "082b6104-8c62-493f-bbbe-28d4628f4674",
                "title": "Adventurers of Beast & Blade: An Eternal Wheel Tale Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "98235c93-8525-4f57-82e5-aaca258732fb",
                "title": "Adventurers of Kingmaker: An Eternal Wheel Saga Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "b8922d93-93dd-4a03-ab33-982546bd4162",
                "title": "Adventurers of Test Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "e150fee5-0680-456b-9b76-24fe9cb7fa69",
                "title": "Adventurers of The Blood & Sand Saga Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "a071996d-d998-4c28-87ef-b4134629dbf0",
                "title": "Adventurers of The Southlands Saga: An Age of Heroes Tale Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "3b462173-b487-49e7-a327-92e416fa5546",
                "title": "Beast & Blade: An Eternal Wheel Tale Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "c5af5b45-d93e-4c9b-aac4-47297b0e73be",
                "title": "Kingmaker: An Eternal Wheel Saga Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "01caf088-43de-48fa-8082-2f5ca7737304",
                "title": "misskelmc",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "b094fd09-73c1-46f8-a968-e4a37c9d7a25",
                "title": "PrinceAloisi",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "22c2e2fa-d1ce-49d9-a418-b603c1f15ab3",
                "title": "sarahjmcc",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "1e57bbd4-9677-49d5-83a6-d759c7818125",
                "title": "Test Campaign Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "5d812551-a5df-4781-b24d-86003f40fc87",
                "title": "The Blood & Sand Saga Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "fe234d31-2c14-429c-a174-2a5c86a0465b",
                "title": "The Southlands Saga: An Age of Heroes Tale Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            }
        ],
        "folderId": "-1",
        "tags": "",
        "updateDate": {
            "date": "2025-04-23 10:04:31.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "cover": {
        "id": 6473405,
        "title": "World Cover.png",
        "slug": null,
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "Image",
        "icon": "fa-solid fa-image",
        "url": "https://wa-cdn.nyc3.cdn.digitaloceanspaces.com/user-data/production/25c82226-f40e-4866-b883-0b0f87436174/uploads/images/f22c93f9d380937a275f9b07ede2b827.png",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": null,
        "updateDate": {
            "date": "2025-03-17 11:48:20.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "coverSource": "World",
    "pronunciation": null,
    "snippet": null,
    "seeded": null,
    "sidebarcontent": null,
    "sidepanelcontenttop": null,
    "sidepanelcontent": null,
    "sidebarcontentbottom": null,
    "footnotes": null,
    "fullfooter": null,
    "authornotes": null,
    "scrapbook": null,
    "credits": null,
    "displaySidebar": true,
    "articleNext": null,
    "articlePrevious": null,
    "timeline": null,
    "prompt": null,
    "gallery": null,
    "articleParent": null,
    "block": null,
    "orgchart": null,
    "showSeeded": false,
    "webhookUpdate": false,
    "communityUpdate": false,
    "commentPlaceholder": null,
    "passcodecta": null,
    "metaTitle": null,
    "metaDescription": null,
    "subheading": null,
    "coverIsMap": false,
    "isFeaturedArticle": false,
    "isAdultContent": false,
    "isLocked": false,
    "allowComments": false,
    "allowContentCopy": false,
    "showInToc": false,
    "isEmphasized": false,
    "displayAuthor": false,
    "displayChildrenUnder": false,
    "displayTitle": true,
    "displaySheet": true,
    "badge": null,
    "editURL": "https://www.worldanvil.com/world/plot/928ce3b7-a190-4bf4-bb58-38f631069449/edit",
    "scenes": null,
    "themes": null,
    "type": null,
    "completionDate": "[b]INACTIVE[/b]",
    "exposition": null,
    "conflict": null,
    "risingaction": null,
    "climax": null,
    "fallingaction": null,
    "resolution": null,
    "goals": null,
    "hooks": null,
    "stakes": null,
    "moralquandaries": null,
    "crueltricks": null,
    "redherrings": null,
    "protagonists": null,
    "allies": null,
    "neutrals": null,
    "competitors": null,
    "adversaries": null,
    "threats": null,
    "locations": null,
    "encounters": null,
    "pastevents": null,
    "ggmtype": "adventure",
    "ggmadventureobjective": null,
    "ggmadventuretheme": "Magic the Gathering",
    "ggmadventuretype": "Discovering",
    "ggmadventurefocustype": "Master Plot",
    "ggmadventureadversarytype": null,
    "ggmadventureopening": null,
    "ggmadventurecoolness": null,
    "ggmadventureexpectation": null,
    "ggmadventuresenses": null,
    "ggmadventurelearnings": null,
    "ggmadventure1goal": null,
    "ggmadventure1enemy": null,
    "ggmadventure1situation": null,
    "ggmadventure2setup": null,
    "ggmadventure2attempt": null,
    "ggmadventure3false": null,
    "ggmadventure3showdown": null,
    "ggmadventurenames": null,
    "ggmadventurechanges": null,
    "parent": null,
    "isEditable": true,
    "success": true
}