{
    "id": "6c055d32-aeb0-418e-ab7d-b3f3ee8e55c7",
    "title": "Session 002 - The Shining Shrine",
    "slug": "session-002---the-shining-shrine-report",
    "state": "public",
    "isWip": false,
    "isDraft": false,
    "entityClass": "Report",
    "icon": "fa-solid fa-clipboard",
    "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/session-002---the-shining-shrine-report",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": "",
    "updateDate": {
        "date": "2024-12-19 07:19:37.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "position": null,
    "excerpt": null,
    "wordcount": 3087,
    "creationDate": {
        "date": "2024-12-18 07:45:13.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "publicationDate": {
        "date": "2024-12-19 06:57:41.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "notificationDate": null,
    "likes": null,
    "views": 47,
    "userMetadata": null,
    "articleMetadata": null,
    "cssClasses": null,
    "displayCss": null,
    "templateType": "report",
    "customArticleTemplate": null,
    "editor": "wysiwyg",
    "content": "The session begins with the monster hunters @[Crumbisur Sayax](person:6c253d23-d31d-40f8-8a03-e8d57a4d3e28), @[Luna Jadeflower](person:e71856cf-f0b9-438b-aca6-18e207bafa83), and @[Richard Reigh](person:7dc1a3e3-a646-4b9a-9a14-cdd446f1f7bf) partaking drinks in the bar of @[Lut's Tavern](location:2b240858-d31e-4caf-9c32-0b70ffc9d8cf). They are interrupted by @[Heliana](person:2c82d59f-8f87-449c-8b57-42dfee7881a1) who introduces them to @[Strider](person:03482554-3a78-4fb3-b78e-56e6dfa9d809) and @[Theophania Thunderthighs](person:9449124c-6672-486c-8b3b-14331acf1050), two fledgling monster hunters that @[Heliana](person:2c82d59f-8f87-449c-8b57-42dfee7881a1) has been training. She askes for the more veteran hunters to take them under their wing for their next bounty. When they agree, @[Heliana](person:2c82d59f-8f87-449c-8b57-42dfee7881a1) provides the group with their bounty poster.\r\n\r\n[img:5983478][img:6190625|center]\r\n[center][i][b]Figure 1: [/b]Monster Bounty Poster given to the heroes by Heliana[/i][/center][img:5983478]\r\nThe group step through one of the many doors of @[Lut's Tavern](location:2b240858-d31e-4caf-9c32-0b70ffc9d8cf) and enter into the @[Shard of Springwood](location:edcd601c-5ff1-4154-939f-13ffdd9817df), the home to all sorts of fantastical beasts and fey. They group is met by @[Threeflower](person:e51adac0-318b-44f9-80ee-cdd2e10258be) and his pet blink squirrel named @[Moo](person:7afc2ade-ec68-4d9f-90a9-d75399dcc5d1). When the party asked more information about Moo, Threeflower explained that he was a fey creature and not a beast, warning against the use of spells such as [i]Speak with Animals. [/i]He gleefully explained that many creatures from @[The Dreamwyld](location:a6bb10f5-5986-412a-84b1-49121ff00ec5) often pop over, and the more fey they see, the closer to @[Springarden](settlement:4216f282-4d79-43f0-9104-85068199a327), the main settlement of the Shard.\r\n[img:5983478][img:6192634|center]\r\n[center][i][b]Figure 2: [/b]Knowledge about the abundance of fey creatures in Springwood was the first clue given to the hunters[/i][/center]\r\n[img:5983478]Threeflower begins to guide the group through Springwood, telling tales of the world to pass time. The group comes upon a party of sprites, who invite them to play a game of high stakes hide and seek. In order for them to participate they are required to place 200 gold pieces into a chest provided by the sprites. In return the sprites placed 1000 gold pieces. In the first round, the sprites were able to win, the second round went to the heroes, the third to the sprites, the fourth to the heroes, and the final round was taken by sprites. However @[Strider](person:03482554-3a78-4fb3-b78e-56e6dfa9d809) was able to determine that the sprites were being mischevious and their gold wasn't real. Following fey law, the sprites returned the heroes their gold and gifted Strider with a @[Fey Twig](item:0fefcae0-9136-48d1-b49c-78a4f3ac9978), explaining that breaking the twig will allow Stride to contact the sprites and ask for help.\r\n\r\nContinuing on with @[Crumbisur Sayax](person:6c253d23-d31d-40f8-8a03-e8d57a4d3e28) taking lead in front, the group comes upon a young green dragon who appeared to be trapped in a cage. Sayax attempts twice to pull the trap open, both times failing, causing a painful electric shock to the young dragon. Realising that he needs the help of a rogue, Sayax requests @[Theophania Thunderthighs](person:9449124c-6672-486c-8b3b-14331acf1050) to use her skills to unlock the trap, which she does with ease. The young dragon thanks the group, introducing himself as @[Sibillus](person:2ea4f0a9-02f6-4343-a160-bf258763996f). He promises a favour from his mother, @[Verdanya](person:6395841f-4248-441d-9495-8619c1b3cb10), an ancient green dragon as a reward and flies off into the forest.\r\n\r\nAs the party continues on the road, @[Chalice of the Gods](person:efae8f7a-a8f5-4f38-8ab4-3215d40760ee) identifies a majestic white stag observing the group, and on closer inspection, the stag telepathically challenges the party to pursue it, then vanishes. The group track the set of tracks left behind deeper into Springwood. Each time they saw the stag, they attempted different magic before realising that magic automatically missed the majestic creature. @[Chalice of the Gods](person:efae8f7a-a8f5-4f38-8ab4-3215d40760ee) gets @[Strider](person:03482554-3a78-4fb3-b78e-56e6dfa9d809) to shoot an arrow, which he does. Before the arrow could hit the stag, the beast vanished again. This time however a [i]heroes feast [/i]was left behind, and the heroes gorged themselves on the sumptuous feast.\r\n\r\nFollowing the path towards @[Springarden](settlement:4216f282-4d79-43f0-9104-85068199a327), @[Threeflower](person:e51adac0-318b-44f9-80ee-cdd2e10258be) talked of the Feyfest, an annual festival that occurs when the constellation of give starts forms overhead:\r\n\r\n[quote]\r\n“Every year we celebrate the coming of the fey. When the stars align, the barrier is weakened and we celebrate with them in joyous mischief. You can see the constellation even now,” he indicates to a cross of five stars in the sky, directly overhead.\r\n[br]“Yorith, the big yellow one in the middle moves west to east. Nagar is the black barely visible one above to the north. Sagin is the fierce red one to its south, Wiyfa—the shimmering white one—is on the west, and Bolubos is the pulsing blue one on the right there. I even have them tattooed,” he says, showing the nape of his neck. His face takes a downcast, melancholy turn. “This year the mischief has turned violent; the beast at the shrine is corrupting the festival.”[/quote]\r\n\r\nShortly after this @[Richard Reigh](person:7dc1a3e3-a646-4b9a-9a14-cdd446f1f7bf) goes off the road and meets a hag by the name of @[Cumely Carmila](person:1ef834f3-edae-477e-bd5a-8c9e5584e746) who requested support in finishing brewring her potion, promising three doses of whatever they procedure. After much discussion the group helps, choosing the correct plants with each instruction; [i]belladona [/i]for \"add the most toxic of plants to the cauldron\" and [i]blood lily [/i]for \"add the plan that grew on the bodies of the fallen after the last great battle of the realm. After stirring a number of times, @[Cumely Carmila](person:1ef834f3-edae-477e-bd5a-8c9e5584e746) gifted three @[potions of resistance](item:25c5a4b5-34ce-4699-a829-bcc03dee1c97).\r\n\r\nAfter the encounter with the hag, the group reached the edges of @[Springarden](settlement:4216f282-4d79-43f0-9104-85068199a327), where @[Threeflower](person:e51adac0-318b-44f9-80ee-cdd2e10258be) encouraged them to meet his brother @[Pyrax](person:257fed61-18b9-4bfb-a16b-08b93197987b) who was recently injured by an unknown beast and is located in the healer's hut. @[Threeflower](person:e51adac0-318b-44f9-80ee-cdd2e10258be) also gifted the group a flyer advertising the annual @[Feyfest](ritual:dadd22cf-6e4d-42fe-9300-3df88a268fbf).\r\n\r\n\r\n[img:5983478][img:6192637|center]\r\n[center][b]Figure 3: [/b]A flyer of the annual Feyfest of Springarden given to the heroes from Threeflower\r\n[img:5983478][/center]The group walk over to the healing hut where they see the body of @[Pyrax](person:257fed61-18b9-4bfb-a16b-08b93197987b) who was in a critical condition, and notice that Pyrax's eyes were milky white, skin was red and blistered, and that they were holding a purple feather in their hand. @[Luna Jadeflower](person:f78642a8-097c-4082-a81e-c09be23701fc) was able to remove the feather from the hand and identified that the feather was resistance to being burned and that any damage to the feather was healed when it was exposed to bright sunlight.\r\n\r\n[img:5983478][img:6192635|center]\r\n[center][i][b]Figure 4: [/b]The feather found on Pyrax by the hunters[/i][/center][img:5983478]\r\n\r\nWith the information they had at hand, the party decided to enter into the spa that was situated at the far north of Springarden. When they entered, they found a beautiful and tranquil place, and Richard encouraged by the ambience, stripped naked and entered into the water. When the dwarf did this, the hunters learned that the water had inherent magical properties, causing either calm emotions or rage. Richard succumbed to the rage, causing him to attack his allies. With the noise caused by this chaos, the @[Suneater Owlbear](species:2c7aef12-0a0f-4945-841f-c8de155573db) awoke and began to attack the hunters.\r\n\r\nWhile difficult, the hunters were able to slowly wear the Suneater Owlbear down, causing a bright-golden forcefield of energy bloom out from the owlbear, causing its body to be suspended in the sphere. The air tingled with the scent of ozone as four glowing orbs coalesced around the garden. These smaller 1-foot-diameter orbs were each a different colour; one sparkled with bright white light, a second swirled with fiery reds, a blue one pulsed rhythmically, and the last was a dark black that drunk in the light of the others. As they bobbed slowly, levitating in the air, the hunters remembered the tale that @[Threeflower](person:e51adac0-318b-44f9-80ee-cdd2e10258be) told them about the stars in the sky, and were able to move the orbs in the formation of the constellation.\r\n\r\nWhen they did this, it caused the golden forcefield to drop, and the @[Suneater Owlbear](species:2c7aef12-0a0f-4945-841f-c8de155573db) attacked them again. The second time, the fey creature clearly had more power, and the hunters slowly but surely defeated the creature. @[Strider](person:03482554-3a78-4fb3-b78e-56e6dfa9d809) used his @[Fey Twig](item:0fefcae0-9136-48d1-b49c-78a4f3ac9978) to call the sprites to help him, and was able to kill the Suneater Owlbear with a well placed shot.\r\n\r\nThe minute the Suneater Owlbear died, a large ripping sound, and the small of ozone filled the area, causing a black hole to be created. @[Strider](person:03482554-3a78-4fb3-b78e-56e6dfa9d809), @[Luna Jadeflower](person:f78642a8-097c-4082-a81e-c09be23701fc), @[Theophania Thunderthighs](person:9449124c-6672-486c-8b3b-14331acf1050) and @[Richard Reigh](person:7dc1a3e3-a646-4b9a-9a14-cdd446f1f7bf) were pulled into the black hole and ended up within @[The Dreamwyld](location:a6bb10f5-5986-412a-84b1-49121ff00ec5).\r\n\r\nMeanwhile, @[Crumbisur Sayax](person:6c253d23-d31d-40f8-8a03-e8d57a4d3e28) remained in the garden where he found a fledging @[Suneater Owlbear](species:2c7aef12-0a0f-4945-841f-c8de155573db) called @[Sunsnacker](person:846a2b14-c6c6-411b-a0d5-3871c6db8bbd). Shortly after Threeflower arrived in the garden and informed Sayax that the people of Springarden had been fighting a number of fey creatures who had popped up throughout the city. Disamayed, Sayax informed what happen to his friends, to which Threeflower informed him they probably transported to the Dreamwyld and took him to a teleportation device that allowed the inhabitants of Springarden to physically visit the Dreamwyld.\r\n\r\nIn the Dreamwyld, the group identify a number of magical items were left behind by the owlbear and they separated them amongst each other:\r\n\r\n[ul]\r\n[li]@[Luna Jadeflower](person:f78642a8-097c-4082-a81e-c09be23701fc) obtained the @[Suncatcher](item:35eebb9c-2b5a-4866-a221-c235b6d59b5a)[/li]\r\n[li]@[Strider](person:03482554-3a78-4fb3-b78e-56e6dfa9d809) obtained the @[Sunwing Bow](item:60437fc1-5fab-4fd2-94a0-4979c15e04bf)[/li]\r\n[li]@[Chalice of the Gods](person:efae8f7a-a8f5-4f38-8ab4-3215d40760ee) obtained @[Bonze's Bokken, Wind Ripper](item:77f49a15-c3b8-4c76-9070-322241297aab)[/li]\r\n[li]@[Richard Reigh](person:7dc1a3e3-a646-4b9a-9a14-cdd446f1f7bf) obtained the @[Suneater Featherfrond](item:2a1b6904-7a35-4212-b14d-d433c517abcf) and @[Ring of Birdseye Maple](item:53ec734f-1270-47b2-91ac-bba02a86900f)[/li]\r\n[li]@[Theophania Thunderthighs](person:9449124c-6672-486c-8b3b-14331acf1050) obtained the @[Sunfeather Shroud](item:54ea712a-884c-4d33-87ec-741f540ef85c)[/li]\r\n[/ul]\r\n\r\nWith all that settled, the group stuck in the Dreamwyld decide to follow the road to see if it led to a way out. Along the way they met the human monk @[Thar Zen](person:05fe1b36-840c-49aa-a2fc-cb2006b46391) who challenged @[Chalice of the Gods](person:efae8f7a-a8f5-4f38-8ab4-3215d40760ee) to a race through the surrounding jungle. @[Chalice of the Gods](person:efae8f7a-a8f5-4f38-8ab4-3215d40760ee) was ultimately the winner, recieving a @[Potion of Speed](item:a9ba378a-7b14-48e2-92fe-b3afaaab9a90).\r\n[img:5983478]\r\n[img:6192636|center]\r\n[center][i]Figure 5: [/i]Art drawn by Heliana after hearing the hunters tale[/center][img:5983478]\r\nThe group eventually met up with @[Crumbisur Sayax](person:6c253d23-d31d-40f8-8a03-e8d57a4d3e28) at a crossroads, and then @[Heliana](person:00ac5095-0a82-48cb-9cc4-7dc31470845b) who helped them return to @[Lut's Tavern](location:2b240858-d31e-4caf-9c32-0b70ffc9d8cf). Once settled in the tavern and telling their story, @[Cacophonics](person:8af98218-2579-43f5-b7e4-de6d0e65e7b8) prepared and performed a song about their exploits.",
    "author": {
        "id": "25c82226-f40e-4866-b883-0b0f87436174",
        "title": "AloisiHaelgor",
        "slug": null,
        "state": null,
        "isWip": null,
        "isDraft": null,
        "entityClass": "User",
        "icon": "fa-solid fa-user",
        "url": "https://www.worldanvil.com/author/AloisiHaelgor",
        "subscribergroups": [],
        "folderId": null,
        "tags": null,
        "updateDate": null
    },
    "category": null,
    "world": {
        "id": "c1ac2421-363b-49d0-b5a1-fd68f279c9cc",
        "title": "The Eternal Wheel",
        "slug": "the-eternal-wheel-aloisihaelgor",
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "World",
        "icon": "fa-solid fa-globe-stand",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor",
        "subscribergroups": [
            {
                "id": "082b6104-8c62-493f-bbbe-28d4628f4674",
                "title": "Adventurers of Beast & Blade: An Eternal Wheel Tale Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "98235c93-8525-4f57-82e5-aaca258732fb",
                "title": "Adventurers of Kingmaker: An Eternal Wheel Saga Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "b8922d93-93dd-4a03-ab33-982546bd4162",
                "title": "Adventurers of Test Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "e150fee5-0680-456b-9b76-24fe9cb7fa69",
                "title": "Adventurers of The Blood & Sand Saga Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "a071996d-d998-4c28-87ef-b4134629dbf0",
                "title": "Adventurers of The Southlands Saga: An Age of Heroes Tale Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "3b462173-b487-49e7-a327-92e416fa5546",
                "title": "Beast & Blade: An Eternal Wheel Tale Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "c5af5b45-d93e-4c9b-aac4-47297b0e73be",
                "title": "Kingmaker: An Eternal Wheel Saga Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "01caf088-43de-48fa-8082-2f5ca7737304",
                "title": "misskelmc",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "b094fd09-73c1-46f8-a968-e4a37c9d7a25",
                "title": "PrinceAloisi",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "22c2e2fa-d1ce-49d9-a418-b603c1f15ab3",
                "title": "sarahjmcc",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "1e57bbd4-9677-49d5-83a6-d759c7818125",
                "title": "Test Campaign Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "5d812551-a5df-4781-b24d-86003f40fc87",
                "title": "The Blood & Sand Saga Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "fe234d31-2c14-429c-a174-2a5c86a0465b",
                "title": "The Southlands Saga: An Age of Heroes Tale Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            }
        ],
        "folderId": "-1",
        "tags": "",
        "updateDate": {
            "date": "2025-04-23 10:04:31.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "cover": {
        "id": 6473405,
        "title": "World Cover.png",
        "slug": null,
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "Image",
        "icon": "fa-solid fa-image",
        "url": "https://wa-cdn.nyc3.cdn.digitaloceanspaces.com/user-data/production/25c82226-f40e-4866-b883-0b0f87436174/uploads/images/f22c93f9d380937a275f9b07ede2b827.png",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": null,
        "updateDate": {
            "date": "2025-03-17 11:48:20.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "coverSource": "World",
    "pronunciation": null,
    "snippet": null,
    "seeded": null,
    "sidebarcontent": null,
    "sidepanelcontenttop": "[img:6190635][img:5983478]",
    "sidepanelcontent": null,
    "sidebarcontentbottom": "[center][img:5983478][url:www.heliana.lt/Suneater|tab]Ballad of the Suneater by Cacophonics[/url][/center]\r\n[quote]\r\n[center][i]The story begins at the festival\r\n[br][/i][/center][center][i]Where stars are all symmetrical\r\n[br][/i][/center][center][i]But a monster is its mimicked face\r\n[br][/i][/center][center][i]And anger it does bring.\r\n[br][/i][/center][center][i]Its nature is to steal the sun\r\n[br][/i]\r\n[br][/center][center][i]And wish the night time not to come\r\n[br][/i][/center][center][i]Oh the wicked beast would fire its beam\r\n[br][/i][/center][center][i]And burn the skin of those who’d seen.\r\n[br][/i][/center][center][i]Some brave adventurers would cross its path\r\n[br][/i]\r\n[br][/center][center][i]And hold their swords aloft\r\n[br][/i][/center][center][i]And once defeated they would find\r\n[br][/i][/center][center][i]The monster rose a final time\r\n[br][/i][/center][center][i]Defiant till its end.\r\n[br][/i]\r\n[br][/center][center][i]Our travellers overcame the night\r\n[br][/i][/center][center][i]And brought the sunlight back to life\r\n[br][/i][/center][center][i]Our friends, we owe our world to you\r\n[br][/i][/center][center][i]You’re heroes through and through.\r\n[br][/i][/center][/quote]\r\n\r\n[img:5983478]",
    "footnotes": null,
    "fullfooter": null,
    "authornotes": null,
    "scrapbook": null,
    "credits": null,
    "displaySidebar": true,
    "articleNext": "eee994b6-2ffd-4e75-ba95-0f96388d54a7",
    "articlePrevious": "51d79ad7-5c74-4548-8076-c9d914e21857",
    "timeline": null,
    "prompt": null,
    "gallery": null,
    "articleParent": {
        "id": "91ef1b1e-e86b-4081-9ec8-3105f5ead85e",
        "title": "The Shardlands Saga",
        "slug": "the-shardlands-saga-plot",
        "state": "public",
        "isWip": false,
        "isDraft": false,
        "entityClass": "Plot",
        "icon": "fa-solid fa-file",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/the-shardlands-saga-plot",
        "subscribergroups": [],
        "folderId": "c8ccec11-0f8b-4ea3-985d-6d49c1bf663f",
        "tags": null,
        "updateDate": {
            "date": "2025-03-17 00:47:38.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "block": null,
    "orgchart": null,
    "showSeeded": false,
    "webhookUpdate": false,
    "communityUpdate": false,
    "commentPlaceholder": null,
    "passcodecta": null,
    "metaTitle": null,
    "metaDescription": null,
    "subheading": null,
    "coverIsMap": false,
    "isFeaturedArticle": false,
    "isAdultContent": false,
    "isLocked": false,
    "allowComments": false,
    "allowContentCopy": false,
    "showInToc": false,
    "isEmphasized": false,
    "displayAuthor": false,
    "displayChildrenUnder": false,
    "displayTitle": true,
    "displaySheet": true,
    "competitionEntries": [
        {
            "id": 1019562,
            "title": "untitled",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "CompetitionEntry",
            "icon": "fa-solid fa-balloon",
            "url": null,
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        }
    ],
    "badge": null,
    "editURL": "https://www.worldanvil.com/world/report/6c055d32-aeb0-418e-ab7d-b3f3ee8e55c7/edit",
    "reportDate": {
        "date": "2024-11-24 00:00:00.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "rewards": "[ul]\r\n[li]@[Bonze's Bokken, Wind Ripper](item:77f49a15-c3b8-4c76-9070-322241297aab) [/li]\r\n[li]@[Fey Twig](item:0fefcae0-9136-48d1-b49c-78a4f3ac9978)[/li]\r\n[li]3 x @[Potion of Resistance](item:25c5a4b5-34ce-4699-a829-bcc03dee1c97)[/li]\r\n[li]1 x @[Potion of Speed](item:a9ba378a-7b14-48e2-92fe-b3afaaab9a90) [/li]\r\n[li]@[Suncatcher](item:35eebb9c-2b5a-4866-a221-c235b6d59b5a) [/li]\r\n[li]@[Ring of Birdseye Maple](item:53ec734f-1270-47b2-91ac-bba02a86900f) [/li]\r\n[li]@[Suneater Featherfrond](item:2a1b6904-7a35-4212-b14d-d433c517abcf) [/li]\r\n[li]@[Sunsnacker](person:846a2b14-c6c6-411b-a0d5-3871c6db8bbd) [/li]\r\n[li]@[Sunwing Bow](item:60437fc1-5fab-4fd2-94a0-4979c15e04bf) [/li]\r\n[/ul]",
    "quests": "[ul]\r\n[li]Hunted and successfully defeated the @[Suneater Owlbear](species:2c7aef12-0a0f-4945-841f-c8de155573db), helping the inhabitants of @[Springarden](settlement:4216f282-4d79-43f0-9104-85068199a327).[/li]\r\n[/ul]",
    "interactions": "[ul]\r\n[li]@[Cumely Carmila](person:1ef834f3-edae-477e-bd5a-8c9e5584e746): A green hag that resides in @[Shard of Springwood](location:edcd601c-5ff1-4154-939f-13ffdd9817df) who the party assisted with breweing her potion.[/li]\r\n[li]@[Heliana](person:2c82d59f-8f87-449c-8b57-42dfee7881a1): Heliana recruits the group of monster hunters to investigate the curious happenings of @[Shard of Springwood](location:edcd601c-5ff1-4154-939f-13ffdd9817df) and hunt down any monster that may be causing issues.[/li]\r\n[li]@[Moo](person:7afc2ade-ec68-4d9f-90a9-d75399dcc5d1): Pet blink squirrel of Threeflower.[/li]\r\n[li]@[Pyrax](person:257fed61-18b9-4bfb-a16b-08b93197987b): Adoptive brother of Threeflower who was injured in a skirmish with the Suneater Owlbear.[/li]\r\n[li]@[Sibillus](person:2ea4f0a9-02f6-4343-a160-bf258763996f): A young green dragon who was trapped in an enchanted steel trap and was freed by the heroes. He offered a favour from his mother as a reward.[/li]\r\n[li]@[Thar Zen](person:05fe1b36-840c-49aa-a2fc-cb2006b46391): A monk who resides in the Dreamwyld.[/li]\r\n[li]@[Threeflower](person:e51adac0-318b-44f9-80ee-cdd2e10258be): A druid in training who met with the monster hunters at the doorway into Springwood, he acted as their guide.[/li]\r\n[li]@[Verdanya](person:6395841f-4248-441d-9495-8619c1b3cb10): An ancient green dragon who is the mother of Sibillus.[/li]\r\n[/ul]",
    "createdContent": null,
    "relatedReports": null,
    "reportNotes": "[ul]\r\n[li]@[Feyfest](ritual:dadd22cf-6e4d-42fe-9300-3df88a268fbf): An annual festival in Springarden that celebrates the alignment of a constellation. [/li]\r\n[li]@[Shard of Springwood](location:edcd601c-5ff1-4154-939f-13ffdd9817df): A forest biome that has a close connection with the Dreamwyld.[/li]\r\n[li]@[Springarden](settlement:4216f282-4d79-43f0-9104-85068199a327): Main settlement of Springwood, where majority of the inhabitants of the Shard reside.[/li]\r\n[li]@[Suneater Owlbear](species:2c7aef12-0a0f-4945-841f-c8de155573db): A rare owlbear species that reside in the Dreamwyld.[/li]\r\n[/ul]",
    "session": null,
    "campaign": null,
    "primarygeographicLocation": {
        "id": "edcd601c-5ff1-4154-939f-13ffdd9817df",
        "title": "Shard of Springwood",
        "slug": "shard-of-springwood-location",
        "state": "public",
        "isWip": false,
        "isDraft": false,
        "entityClass": "Location",
        "icon": "fa-solid fa-mountain",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/shard-of-springwood-location",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": null,
        "updateDate": {
            "date": "2024-10-22 10:26:12.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "secondarygeographicLocation": {
        "id": "98432c84-99ef-4536-b222-41e7352e34f9",
        "title": "Springarden",
        "slug": "springarden-settlement",
        "state": "public",
        "isWip": true,
        "isDraft": true,
        "entityClass": "Settlement",
        "icon": "fa-solid fa-file",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/springarden-settlement",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": "",
        "updateDate": {
            "date": "2024-12-18 23:57:36.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "plots": [
        {
            "id": "91ef1b1e-e86b-4081-9ec8-3105f5ead85e",
            "title": "The Shardlands Saga",
            "slug": "the-shardlands-saga-plot",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Plot",
            "icon": "fa-solid fa-file",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/the-shardlands-saga-plot",
            "subscribergroups": [],
            "folderId": "c8ccec11-0f8b-4ea3-985d-6d49c1bf663f",
            "tags": null,
            "updateDate": {
                "date": "2025-03-17 00:47:38.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        }
    ],
    "relatedPersons": [
        {
            "id": "6c253d23-d31d-40f8-8a03-e8d57a4d3e28",
            "title": "Crumbisur Sayax",
            "slug": "crumbisur-sayax-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/crumbisur-sayax-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-18 11:39:22.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "1ef834f3-edae-477e-bd5a-8c9e5584e746",
            "title": "Cumely Carmila",
            "slug": "cumely-carmila-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/cumely-carmila-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 12:32:08.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "00ac5095-0a82-48cb-9cc4-7dc31470845b",
            "title": "Heliana",
            "slug": "heliana-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/heliana-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 07:21:31.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "f78642a8-097c-4082-a81e-c09be23701fc",
            "title": "Luna Jadeflower",
            "slug": "luna-jadeflower-person-1",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/luna-jadeflower-person-1",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-18 11:51:39.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "7afc2ade-ec68-4d9f-90a9-d75399dcc5d1",
            "title": "Moo",
            "slug": "moo-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/moo-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 12:07:46.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "257fed61-18b9-4bfb-a16b-08b93197987b",
            "title": "Pyrax",
            "slug": "pyrax-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/pyrax-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 12:23:57.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "7dc1a3e3-a646-4b9a-9a14-cdd446f1f7bf",
            "title": "Richard Reigh",
            "slug": "richard-reigh-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/richard-reigh-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-18 11:49:48.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "2ea4f0a9-02f6-4343-a160-bf258763996f",
            "title": "Sibillus",
            "slug": "sibillus-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/sibillus-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 12:27:02.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "03482554-3a78-4fb3-b78e-56e6dfa9d809",
            "title": "Strider",
            "slug": "strider-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/strider-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-18 11:46:29.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "05fe1b36-840c-49aa-a2fc-cb2006b46391",
            "title": "Thar Zen",
            "slug": "thar-zen-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/thar-zen-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 07:19:10.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "9449124c-6672-486c-8b3b-14331acf1050",
            "title": "Theophania Thunderthighs",
            "slug": "theophania-thunderthighs-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/theophania-thunderthighs-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": null,
            "updateDate": {
                "date": "2024-12-18 08:10:58.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "e51adac0-318b-44f9-80ee-cdd2e10258be",
            "title": "Threeflower",
            "slug": "threeflower-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/threeflower-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 12:06:07.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        }
    ],
    "isEditable": true,
    "success": true
}