{
    "id": "51d79ad7-5c74-4548-8076-c9d914e21857",
    "title": "Session 001 - Polyhedrooze",
    "slug": "session-001---polyhedrooze-report",
    "state": "public",
    "isWip": false,
    "isDraft": false,
    "entityClass": "Report",
    "icon": "fa-solid fa-clipboard",
    "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/session-001---polyhedrooze-report",
    "subscribergroups": [],
    "folderId": "-1",
    "tags": "",
    "updateDate": {
        "date": "2024-12-19 07:12:19.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "position": null,
    "excerpt": null,
    "wordcount": 3516,
    "creationDate": {
        "date": "2024-12-18 22:47:06.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "publicationDate": {
        "date": "2024-12-18 23:07:10.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "notificationDate": null,
    "likes": null,
    "views": 27,
    "userMetadata": null,
    "articleMetadata": null,
    "cssClasses": null,
    "displayCss": null,
    "templateType": "report",
    "customArticleTemplate": null,
    "editor": "wysiwyg",
    "content": "The session begins with five monster hunters: @[Crumbisur Sayax](person:6c253d23-d31d-40f8-8a03-e8d57a4d3e28) the dragon fighter, @[Luna Jadeflower](person:f78642a8-097c-4082-a81e-c09be23701fc) the wood elf druid, @[Chalice of the Gods](person:efae8f7a-a8f5-4f38-8ab4-3215d40760ee) the aasimar paladin, @[Richard Reigh](person:7dc1a3e3-a646-4b9a-9a14-cdd446f1f7bf) the dwarf cleric, and @[Siggy](person:59dd81da-92df-4e5d-8a17-1f7238f29a9b) the infernal tiefling barbarian, are sitting at a table in Lut's Tavern having a drink...or two. Shortly after Heliana explains that the Frockit Clan of the Shard of Maphrok were having issues and needed help. The heroes agreed to take on the monster hunt, and Heliana directed them to speak with Bogbolz who will lead them to a place called The Big Bad Base.\r\n\r\n[img:5983478]\r\n[img:5995657|center]\r\n[center][i][b]Figure 1: [/b]Monster Bounty Poster given to the heroes by Heliana\r\n[img:5983478][/i][/center]\r\nBefore the heroes leave Lut's Tavern, Chalice of the Gods asks Luna Jadeflower to craft a wooden flower which she gifts to Heliana with a wink. With this, the heroes drink some port ale and step through a portal door, and they arrive in a humid and thick jungle. Realising that there is no visibile path, Luna Jadeflower using her skills as a nature guide, began to lead the party through the thicket, and they eventually arrive across a field of flowers with an intoxicating. An investigation of the flowers identifies them as @[Oyohuisca Pyrexia](species:7c541967-a12b-4e62-8cf3-df77d002b0b1) - a hallucinogenic flower that can give prophetic dreams. Luna Jadeflower plucks a few and places them in her bag, with Siggy copying her and taking a few for herself.\r\n\r\nNext Richard Reigh beseeches his god to show him the way; he feels a divine presence push his mace in a direction. The heroes follow the sign, and they arrive to the ancient temple known as Ruins of Relanoris. They see a shiny gold idol at the centre of the temple and identify that there are pictograms on the walls. Richard Reigh is able to decipher the ancient language and explains that the pictograms show a ritualistic dance. The dwarf completes the dance which ends with him touching the Relanorian Relic and recieving a blessing. The idol then dims, and Richard Reigh takes the relic and places it in his bag.\r\n\r\nSiggy walks off in front in the same direction that the mace was pointing, and being swept up in her confidence, the rest of group follow her. Eventually they come across an unusual battlefield that was contained damaged hives in the trees and large holes in the ground. They are then attacked by a Giant Wasp and a Swarm of Insects(Wasps). After a short skirmish Chalice of the Gods hits the killing blow on the giant wasp, and Luna Jadeflower kills the swarm of insects (wasps).\r\n\r\nCrumbisur Sayax finds a clearing that leads away from the clearing, and eventually leads the party to the Dais of Leadenglen, where they find three large drums on a raised dais. Richard Reigh, Siggy, and Crumbisur Sayax start to play the drums, and Richard Reigh notices they are crafted out of human bones and skin. Crumbisur Sayax and Richard Reigh stop playing but Siggy continues. Luna Jadeflower identifies that the stone pathway around the dais is a musical score.\r\n\r\nReading the score, Crumbisur Sayax begins to play the notes correctly. This causes sombre music to start playing in the air, and an undead direwolf comes out of the mists. Crumbisur Sayax names it Cupcake and comments that he feels as if it will obey the dragonborn's command. Richard Reigh and Chalice of the Gods who were playing the drums with Crumbisur Sayax feel necrotic magic sap at their strength for playing the notes incorrectly.\r\n\r\nThe group then decides to continue on, and they see a big mountain in the distance. As they make their way through the jungle, they notice monkeys with hexagon shaped tails, flowers with geometric patterns, and cubed fruit hanging from trees. Eventually on the outskirts they are greeted by an elderly goblin who introduces herself as Bogbolz. After confirmation that Heliana had sent the group, Bogbolz guided the group through a tidy and well-organised goblin camp. She explains that the Frockit Clan, sometimes known as the Frockit Goblin Collective, are dungeon builders and they were preparing a dungeon for their client. Unfortunately when they were transporting their client's treasure to the vault they had built, a large ooze sucked up the treasure and some goblin workers.\r\n\r\nBogbolz leads the group to a large metal cage which contained a ooze. She asked the heroes if they had any treasure; Crumbisur Sayax offered a crossbow, Chalice of the Gods offered a silver coin, and Siggy offers a flower. Bogbolz takes the items and separates the flower from the crossbow and coin. She places the flower on the ground with some rat meat, and then places the crossbow and coin on the other side. Bogbolz then opens the cage door and jumps out of the way. The group watch as the ooze momentarily pause, and then immediately engulf the treasure.\r\n\r\n[img:5983478][img:5995660|center]\r\n[center][i][b]Figure 2:[/b] [/i]The [i]first clude about the polyhedroozes given to the group by Bogbolz[/i][/center][img:5983478]There is a short discussion between Crumbisur Sayax and Richard Reigh about dwarven hygiene habits, and we discover Rick's wife shampoo's her beard. The ooze then attacks the group, who easily defeat it, however they identified that when the ooze took a type of damage, it would then react and protect itself from a similar attack.\r\n[img:5983478][img:5995661|center]\r\n[center][i][b]Figure 3: [/b]The second clue about the polyhedroozes reactive mutation ability is discovered by the heroes after they fight one of them[/i][/center][img:5983478]\r\nAs the ooze is killed, Chalice of the Gods falls into a pit with a sign falling after her. The pit is filled with stakes, and using some rope the group helps her climb out to safety. Chalice of the Gods then reads what the sign says to the heroes and they deduce that The Big Bad Base will have a number of traps considering it was once the property of kobolds.\r\n[img:5983478][img:5995664|center]\r\n[center][i][b]Figure 4: [/b]The third and final clue which was found after Chalice fell into a pit trap[/i][/center][img:5983478]Before the party continues into the The Big Bad Base they decide to rest a bit and prepare for the task ahead. After resting Luna Jadeflower and Siggy go upstairs to investigate the Common Room which appears to have been recently vacated with mugs of ale half drunk and food that was half eaten. They find two pathways leading out of the room, one of them having a locked door that Siggy smashed open. Luna Jadeflower and Siggy decided to individually investigate a tunnel each. Shortly after Crumbisur Sayax, Chalice of the Gods, and Richard Reigh enter the Common Room and follow after their friends. Chalice of the Gods follows Luna Jadeflower while Crumbisur Sayax and Richard Reigh go right to follow Siggy.\r\n\r\nChalice of the Gods and Luna Jadeflower traverse the tunnel on the left that leads them to a pair of stairs that have a steep descent. When they step on the top most step, an oil trap is triggered causing the stairs to become slippery and they both fall to the bottom. As they reach the bottom, the last stone step slides away, and they fall into a blue-green pool (Mut-X). They get out of the pool and find that they have simply arrived back at the entrance of The Big Bad Base.\r\n\r\nCrumbisur Sayax, Siggy, and Richard Reigh enter into the tunnel on the right, where they find a large room with the floor pockmarked with small craters and a shrine to the many-headed Dragon Queen. Siggy and Richard Reigh walk towards the shrine by walking over the craters and arrive at the shrine. Crumbisur Sayax attempts to walk over the area that does not have a crater and causes a pressure plate to click and an explosion to happen. After fixing himself up, he walks over to the rest of the party by using the craters to determine where was safe. Siggy picked up the idol that was on the shrine and observed that it was made with love but not skill and she places it back. Richard Reigh informs his friends that it appears the room was once a kobold hideout and used his tremorsense to determine that the craters throughout the room is the safe passage to the door to the north.\r\n\r\nChalice of the Gods and Luna Jadeflower clean as much of the Mut-X they could off themselves and then make their way towards where the rest of the party is. The party in the Crater Room yell a warning out to them about the traps and the party make their way safely across the rest of the room. As they exit the room they discover three pathways, one going left, one going right, and one going straight. Siggy investigates the path that leads north and she finds a dead end. Searching around the dead end she finds two dried mushrooms which are Noradreno Mucorales. Meanwhile Crumbisur Sayax takes the left path while the others take the right.\r\n\r\nChalice of the Gods, Richard Reigh, and Luna Jadeflower enter into a room that contained a 15-foot-tall tank made of brass that glowed with the same blue-green liquid that some of the party fell into earlier. They notice that pipes ran from barrells filled with yellow acid into the tank. Each of the barrels appeared to be marked by a red dragon's head. As they investigate the room Bogbolz joins them and starts to read her ledger that was left in the room when the Frockkit Clan abandoned the site. She explains that the creature engulfed roughly 1,200 gold pieces worth of treasure. She reads something in the ledger and giggles, and tells the party \"Don't carry too much treasure or you'll hurt your back!\". Siggy then joins the party in the tank room.\r\n\r\nMeanwhile Crumbisur Sayax is investigating the path on the left, which leads him into a store room that contained stacks of barrels marked with red dragon heads in various alcoves. Investigating the area, he finds a Clockwork Dynamite in sacks in the southeastern section of the room. As Crumbisur Sayax investigates the western area of the dungeon, the rest of the group continues to talk to Bogbolz who informs them that if people fall into the blue-green liquid it causes mutations to occur such as webbed feet, enlarged hands, but assures the party that they eventually go away. Further discussion uncovers that the dungeon was empty when the Frockkit Clan arrived, however they have found documents and research of Dr. Francis Norman Stein. The party then decides to investigate the door to the south, while Richard Reigh leaves a note behind for Crumbisur Sayax. They find an empty cavern which used to be a stable, and eventually connects back to the front of the dungeon. They head back the way they came and go through the door to the north.\r\n\r\nCrumbisur Sayax explores further north and finds another tank room with the Mut-X liquid, but also finds a pouch that was filled with spiders, and 50 silver pieces. The party in the eastern caverns enter into another tank room, where Richard Reigh identifies that the architecture is human but it was constructed by kobold claws. They continue north where the enter another tank room, however to the west of the room they see a doorway filled with blue light. They enter through the doorway to find a giant chamber filled with blue lights and a deep pool of liquid with treasure and bones throughout the liquid suspended.\r\n\r\nStill separated from the main group, Crumbisur Sayax enters another room but this one contained a locked door. He attempted multiple ways to break the door open, however it does not work. He leaves the room and finds another locked door, however when he tries to manipulate this one, a number of vials drop from the ceiling causing him to be coated in a foul smelling liquid. He manages to grab two off the ceiling and pockets them. Crumbisur Sayax also takes a barrel of oil, and then heads back to where the rest of the party is.\r\n\r\nIn the large chamber Luna Jadeflower confidently informs the party that the pool is filled with a liquid of some sort, while Chalice of the Gods flicks in a copper coin, and it slowly sinks as if it was moving through something solid. The party discusses and agree that it is the Biomantic Polyhedrooze they were hunting. Crumbisur Sayax rejoins the party and they decide to continue to investigate the chamber before confronting their target. They enter into a cavern on the eastern section of the chamber where they find a warm spring. Crumbisur Sayax entered into the spring to scrub off the strench. However as he does so, he feels his body start to tingle, and the dirt is replaced by a golden radiation and glow.\r\n\r\nSiggy decides to wade through the pool to examine the dragon skulls that are placed on the back of the wall. As she does, she is also mutated by the Mut-X, which exhibits itself as two left feet. Siggy continues through and identifies that the dragon skulls are crudely made, and she leaves 15 copper coins in the wall alcoves as a sign of respect.\r\n\r\nThe party leaves this spring cavern and travel across the larger chamber to a small area on the left, where they find an office that contained papers and a large safe. The safe contained a plaque with \"Dr. Stein's Spellbooks\", and they identify the safe has an arcane lock on it. Siggy and Crumbisur Sayax start smashing the lock, with Richard Reigh providing much needed guidance. Eventually they break open the safe and find Dr. Stein's Book of Biomancy which contains a unique number of spells.\r\n\r\nLuna Jadeflower and Chalice of the Gods examine the papers and find two spell scrolls: one for Endoleech and the other for Chameleon Skin. Clearing out the office, the party decide to rest shortly before they interact with the polyhedrooze.\r\n\r\nRested, the heroes set up a ring of barrels with oil and then lay the treasure trap for the ooze. Not long after they hear some squelching and a giant ooze, The Motherload, appears.\r\n[img:5983478][img:5995658|center]\r\n[center][i][b]Figure 5: [/b]The Motherload by Heliana after hearing the heroes tale[/i][/center][img:5983478]The group sets fire to the barrels in hope the fire would trap The Motherload however this is unsuccessful. After managing the monsters resistances, the heroes eventually defeat the creature. They search the left over treasure where they find 1,650 gold pieces which they pay $1,200 back to Bogbolz. Each of the heroes also found additional items:\r\n\r\n[ul]\r\n[li]@[Crumbisur Sayax](person:6c253d23-d31d-40f8-8a03-e8d57a4d3e28) obtained the @[Ventilation Unit D-20](item:8fe959bc-8c92-466e-ab6a-8a3018984b97) and @[Slime-in-a-Skull](item:26ab3db0-8433-4f01-9ec7-787b1416bab9)[/li]\r\n[li]@[Luna Jadeflower](person:f78642a8-097c-4082-a81e-c09be23701fc) obtains @[Oozemat Coat](item:1128481b-ebab-4214-bc19-e76632ee51dc) and @[Bomboozler](item:0d0e0e79-a8a7-48e8-af52-0db2e5fba49b)[/li]\r\n[li]@[Chalice of the Gods](person:efae8f7a-a8f5-4f38-8ab4-3215d40760ee) obtains @[Goo Luck Dice](item:3288be5b-63bc-4d44-a785-73e5e9b26889) and @[Caltrooze](item:e3726d23-c3b0-4054-9c9b-958503294909)[/li]\r\n[li]@[Richard Reigh](person:7dc1a3e3-a646-4b9a-9a14-cdd446f1f7bf) obtains @[Flooze](item:859ac75d-6938-4870-bcdd-e792d96c5961)[/li]\r\n[li]@[Siggy](person:59dd81da-92df-4e5d-8a17-1f7238f29a9b) obtains @[Gelatinooze](species:e3526a74-436d-44d2-9849-c79592aa6c55)[/li]\r\n[/ul]\r\n\r\nExiting The Big Bad Base the heroes are thanked by Bogbolz who pays them 75 gold pieces each and offers the services of Frockkit Clan for free.\r\n\r\nThe group returns to Lut's Tavern where they meet Heliana again. Chalice of the Gods uses the opportunity to flirt with the orc. The bard Cacophonics sings a song for the entire tavern after hearing the exploits of the heroes.",
    "author": {
        "id": "25c82226-f40e-4866-b883-0b0f87436174",
        "title": "AloisiHaelgor",
        "slug": null,
        "state": null,
        "isWip": null,
        "isDraft": null,
        "entityClass": "User",
        "icon": "fa-solid fa-user",
        "url": "https://www.worldanvil.com/author/AloisiHaelgor",
        "subscribergroups": [],
        "folderId": null,
        "tags": null,
        "updateDate": null
    },
    "category": null,
    "world": {
        "id": "c1ac2421-363b-49d0-b5a1-fd68f279c9cc",
        "title": "The Eternal Wheel",
        "slug": "the-eternal-wheel-aloisihaelgor",
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "World",
        "icon": "fa-solid fa-globe-stand",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor",
        "subscribergroups": [
            {
                "id": "082b6104-8c62-493f-bbbe-28d4628f4674",
                "title": "Adventurers of Beast & Blade: An Eternal Wheel Tale Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "98235c93-8525-4f57-82e5-aaca258732fb",
                "title": "Adventurers of Kingmaker: An Eternal Wheel Saga Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "b8922d93-93dd-4a03-ab33-982546bd4162",
                "title": "Adventurers of Test Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "e150fee5-0680-456b-9b76-24fe9cb7fa69",
                "title": "Adventurers of The Blood & Sand Saga Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "a071996d-d998-4c28-87ef-b4134629dbf0",
                "title": "Adventurers of The Southlands Saga: An Age of Heroes Tale Party",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "3b462173-b487-49e7-a327-92e416fa5546",
                "title": "Beast & Blade: An Eternal Wheel Tale Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "c5af5b45-d93e-4c9b-aac4-47297b0e73be",
                "title": "Kingmaker: An Eternal Wheel Saga Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "01caf088-43de-48fa-8082-2f5ca7737304",
                "title": "misskelmc",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "b094fd09-73c1-46f8-a968-e4a37c9d7a25",
                "title": "PrinceAloisi",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "22c2e2fa-d1ce-49d9-a418-b603c1f15ab3",
                "title": "sarahjmcc",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "1e57bbd4-9677-49d5-83a6-d759c7818125",
                "title": "Test Campaign Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "5d812551-a5df-4781-b24d-86003f40fc87",
                "title": "The Blood & Sand Saga Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            },
            {
                "id": "fe234d31-2c14-429c-a174-2a5c86a0465b",
                "title": "The Southlands Saga: An Age of Heroes Tale Players",
                "slug": null,
                "state": null,
                "entityClass": "SubscriberGroup",
                "icon": null,
                "url": null,
                "subscribergroups": []
            }
        ],
        "folderId": "-1",
        "tags": "",
        "updateDate": {
            "date": "2025-04-23 10:04:31.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "cover": {
        "id": 6473405,
        "title": "World Cover.png",
        "slug": null,
        "state": "public",
        "isWip": null,
        "isDraft": null,
        "entityClass": "Image",
        "icon": "fa-solid fa-image",
        "url": "https://wa-cdn.nyc3.cdn.digitaloceanspaces.com/user-data/production/25c82226-f40e-4866-b883-0b0f87436174/uploads/images/f22c93f9d380937a275f9b07ede2b827.png",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": null,
        "updateDate": {
            "date": "2025-03-17 11:48:20.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "coverSource": "World",
    "pronunciation": null,
    "snippet": null,
    "seeded": null,
    "sidebarcontent": null,
    "sidepanelcontenttop": "[img:5995668|center]\r\n[img:5983478]",
    "sidepanelcontent": null,
    "sidebarcontentbottom": "[img:5983478]\r\n[center][url:https://www.loottavern.com/Musicfile/Polyhedrooze_TAVERN.mp3|tab]Ballad of the Motherload by Cacophonics[/url][/center]\r\n[quote]\r\n[center][i]Down in The Low where our wanderers go[/i][i]\r\n[br][/i]\r\n[i]The lair of Francis Stein\r\n[br][/i]\r\n[i]There’s a treasure trove the goblins tried\r\n[br][/i]\r\n[i]To move it all in time\r\n[br][/i]\r\n[br]\r\n[i]No one could know that hiding below\r\n[br][/i]\r\n[i]The acid was biding time\r\n[br][/i]\r\n[i]And The Motherload would ooze its way\r\n[br][/i]\r\n[i]Up to the pool side\r\n[br][/i]\r\n[br]\r\n[i]Shining gifts it couldn’t resist\r\n[br][/i]\r\n[i]But it learned to resist attack\r\n[br][/i]\r\n[i]So be sure to keep a careful eye\r\n[br][/i]\r\n[i]And navigate the traps\r\n[br][/i]\r\n[br]\r\n[i]The wanderers knew defeating the ooze\r\n[br][/i]\r\n[i]Would not be an easy feat\r\n[br][/i]\r\n[i]But the treasure promised with success\r\n[br][/i]\r\n[i]Makes the victory ever sweet\r\n[br][/i][/center][/quote]\r\n[img:5983478]",
    "footnotes": null,
    "fullfooter": null,
    "authornotes": null,
    "scrapbook": null,
    "credits": null,
    "displaySidebar": true,
    "articleNext": "6c055d32-aeb0-418e-ab7d-b3f3ee8e55c7",
    "articlePrevious": null,
    "timeline": null,
    "prompt": null,
    "gallery": null,
    "articleParent": {
        "id": "91ef1b1e-e86b-4081-9ec8-3105f5ead85e",
        "title": "The Shardlands Saga",
        "slug": "the-shardlands-saga-plot",
        "state": "public",
        "isWip": false,
        "isDraft": false,
        "entityClass": "Plot",
        "icon": "fa-solid fa-file",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/the-shardlands-saga-plot",
        "subscribergroups": [],
        "folderId": "c8ccec11-0f8b-4ea3-985d-6d49c1bf663f",
        "tags": null,
        "updateDate": {
            "date": "2025-03-17 00:47:38.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "block": null,
    "orgchart": null,
    "showSeeded": false,
    "webhookUpdate": false,
    "communityUpdate": false,
    "commentPlaceholder": null,
    "passcodecta": null,
    "metaTitle": null,
    "metaDescription": null,
    "subheading": null,
    "coverIsMap": false,
    "isFeaturedArticle": false,
    "isAdultContent": false,
    "isLocked": false,
    "allowComments": false,
    "allowContentCopy": false,
    "showInToc": false,
    "isEmphasized": false,
    "displayAuthor": false,
    "displayChildrenUnder": false,
    "displayTitle": true,
    "displaySheet": true,
    "competitionEntries": [
        {
            "id": 1019004,
            "title": "untitled",
            "slug": null,
            "state": null,
            "isWip": null,
            "isDraft": null,
            "entityClass": "CompetitionEntry",
            "icon": "fa-solid fa-balloon",
            "url": null,
            "subscribergroups": [],
            "folderId": null,
            "tags": null,
            "updateDate": null
        }
    ],
    "badge": null,
    "editURL": "https://www.worldanvil.com/world/report/51d79ad7-5c74-4548-8076-c9d914e21857/edit",
    "reportDate": {
        "date": "2024-09-27 00:00:00.000000",
        "timezone_type": 3,
        "timezone": "Europe/London"
    },
    "rewards": "[ul]\r\n[li]@[Bomboozler](item:0d0e0e79-a8a7-48e8-af52-0db2e5fba49b) [/li]\r\n[li]@[Caltrooze](item:e3726d23-c3b0-4054-9c9b-958503294909) [/li]\r\n[li]@[Clockwork Dynamite](item:7a27f1dd-c72e-48d9-889c-c4f1bcef5ba9) [/li]\r\n[li]@[Dr. Stein's Book of Biomancy](item:29051c26-546e-4868-bca4-d8e3c1a00c5b) [/li]\r\n[li]@[Flooze](item:859ac75d-6938-4870-bcdd-e792d96c5961) [/li]\r\n[li]@[Goo Luck Dice](item:3288be5b-63bc-4d44-a785-73e5e9b26889) [/li]\r\n[li]@[Oozemat Coat](item:1128481b-ebab-4214-bc19-e76632ee51dc) [/li]\r\n[li]@[Relanorian Relic](item:f1e858ed-eb3c-433e-b84b-e9d774d58440) [/li]\r\n[li]Spell Scroll of @[Chameleon Skin](spell:a97e6faf-ed06-481a-93ef-2176c7550e0b) [/li]\r\n[li]Spell Scroll of @[Endoleech](spell:6e403ed4-6920-4d67-aca4-be6fca1b758f) [/li]\r\n[li]@[Ventilation Unit D-20](item:8fe959bc-8c92-466e-ab6a-8a3018984b97) [/li]\r\n[/ul]",
    "quests": "[ul]\r\n[li]Successfully hunted and defeated @[The Motherload](species:899d9670-cf99-4809-9f67-3a5977a17aa8), helping the @[Frockkit Clan](organization:1ae6f410-693c-4fdd-99c1-f460aca5e284).[/li]\r\n[/ul]",
    "interactions": "[ul]\r\n[li]@[Heliana](person:00ac5095-0a82-48cb-9cc4-7dc31470845b): A monster hunter the heroes met in Lut's Tavern, she recruited the heroes to help the Frockkit Clan[/li]\r\n[li]@[Bogbolz](person:4c4a611f-88c8-47ea-8e79-6cb701af643e): The leader of the gnome clan of Frockkit, whom acted as a guide through the Big Bad Base.[/li]\r\n[li]@[Cacophonics](person:8af98218-2579-43f5-b7e4-de6d0e65e7b8): A bard that lives in Lut's Tavern, he tends to sing songs about the monster hunters' exploits.[/li]\r\n[/ul]",
    "createdContent": null,
    "relatedReports": null,
    "reportNotes": "[ul]\r\n[li]@[Frockkit Clan](organization:1ae6f410-693c-4fdd-99c1-f460aca5e284): One of the goblin clans that reside in the Shard of Maphrok, known for their dungeon building skills.[/li]\r\n[li]@[Dais of Leadenglen](landmark:61018cee-7d8e-4f84-8cfe-347ebee10eb0): An ancient ruin where the heroes identified old runes that contained a music score.[/li]\r\n[li]@[Ruins of Relanoris](landmark:c792b390-4815-4e0e-9b2a-c94782342463): An ancient ruin where Richard identified an ritual inscribed on it's walls that depicted a dance.[/li]\r\n[li]@[Giant Wasp](species:c34bbe29-df9d-4f2c-a438-57b7794f54d3): The heroes fought giant wasps in a clearing that looked like a battlefield between giant wasps and giant ants.[/li]\r\n[li]@[Swarm of Insects](species:681d0281-706a-4378-bbdc-e7c7c2a6da54): The heroes fought giant wasps in a clearing that looked like a battlefield between giant wasps and giant ants.[/li]\r\n[li]@[Tetrahedrooze](species:191d8435-6741-4138-ba1d-9357e3eb44b5): One of the biomantic polyhedroozes found in the Big Bad Base that had a pyramid shape.[/li]\r\n[li]@[Hexahedrooze](species:a4167612-adbd-4b4c-a5da-c41e65e34e03): One of the biomantic polyhedroozes found in the Big Bad Base that had a cube shape.[/li]\r\n[li]@[The Motherload](species:899d9670-cf99-4809-9f67-3a5977a17aa8): A large biomantic polyhedrooze which was the target of the hunt contract. The heroes defeated it.[/li]\r\n[/ul]",
    "session": null,
    "campaign": null,
    "primarygeographicLocation": {
        "id": "fa71496e-c16b-4e70-8666-d75c0d57cf37",
        "title": "Shard of Maphrok",
        "slug": "shard-of-maphrok-location",
        "state": "public",
        "isWip": false,
        "isDraft": false,
        "entityClass": "Location",
        "icon": "fa-solid fa-mountain",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/shard-of-maphrok-location",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": null,
        "updateDate": {
            "date": "2024-10-22 10:24:07.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "secondarygeographicLocation": {
        "id": "6f10c71f-afb6-4415-9408-c3ac5dfa09e6",
        "title": "The Big Bad Base",
        "slug": "the-big-bad-base-landmark",
        "state": "public",
        "isWip": false,
        "isDraft": false,
        "entityClass": "Landmark",
        "icon": "fa-solid fa-file",
        "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/the-big-bad-base-landmark",
        "subscribergroups": [],
        "folderId": "-1",
        "tags": null,
        "updateDate": {
            "date": "2024-10-22 10:25:46.000000",
            "timezone_type": 3,
            "timezone": "Europe/London"
        }
    },
    "plots": [
        {
            "id": "91ef1b1e-e86b-4081-9ec8-3105f5ead85e",
            "title": "The Shardlands Saga",
            "slug": "the-shardlands-saga-plot",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Plot",
            "icon": "fa-solid fa-file",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/the-shardlands-saga-plot",
            "subscribergroups": [],
            "folderId": "c8ccec11-0f8b-4ea3-985d-6d49c1bf663f",
            "tags": null,
            "updateDate": {
                "date": "2025-03-17 00:47:38.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        }
    ],
    "relatedPersons": [
        {
            "id": "4c4a611f-88c8-47ea-8e79-6cb701af643e",
            "title": "Bogbolz",
            "slug": "bogbolz-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/bogbolz-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 07:16:45.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "8af98218-2579-43f5-b7e4-de6d0e65e7b8",
            "title": "Cacophonics",
            "slug": "cacophonics-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/cacophonics-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 07:09:06.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "efae8f7a-a8f5-4f38-8ab4-3215d40760ee",
            "title": "Chalice of the Gods",
            "slug": "chalice-of-the-gods-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/chalice-of-the-gods-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-18 11:49:36.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "6c253d23-d31d-40f8-8a03-e8d57a4d3e28",
            "title": "Crumbisur Sayax",
            "slug": "crumbisur-sayax-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/crumbisur-sayax-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-18 11:39:22.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "00ac5095-0a82-48cb-9cc4-7dc31470845b",
            "title": "Heliana",
            "slug": "heliana-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/heliana-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2024-12-19 07:21:31.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "f78642a8-097c-4082-a81e-c09be23701fc",
            "title": "Luna Jadeflower",
            "slug": "luna-jadeflower-person-1",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/luna-jadeflower-person-1",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-18 11:51:39.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "7dc1a3e3-a646-4b9a-9a14-cdd446f1f7bf",
            "title": "Richard Reigh",
            "slug": "richard-reigh-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/richard-reigh-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-18 11:49:48.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        },
        {
            "id": "59dd81da-92df-4e5d-8a17-1f7238f29a9b",
            "title": "Siggy",
            "slug": "siggy-person",
            "state": "public",
            "isWip": false,
            "isDraft": false,
            "entityClass": "Person",
            "icon": "fa-solid fa-user-crown",
            "url": "https://www.worldanvil.com/w/the-eternal-wheel-aloisihaelgor/a/siggy-person",
            "subscribergroups": [],
            "folderId": "-1",
            "tags": "",
            "updateDate": {
                "date": "2025-03-18 11:54:16.000000",
                "timezone_type": 3,
                "timezone": "Europe/London"
            }
        }
    ],
    "isEditable": true,
    "success": true
}